#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
aws_vpc.vpc_fiap: Refreshing state... [id=vpc-05e2b1215d82e4028]
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_iam_role.node: Refreshing state... [id=eks-node-group-role]
aws_s3_bucket.spoobucket-aula: Refreshing state... [id=spoo-ent9-backend]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_internet_gateway.igw: Refreshing state... [id=igw-089bdf126f779bacd]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-0994fc654394d1a45]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-00f9552ea0b8b879d]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-0ee538e1285294135]
aws_security_group.sg: Refreshing state... [id=sg-08837d9ccdb85d124]
aws_route_table.rt_public: Refreshing state... [id=rtb-06ea70f38b11233ce]
aws_route_table_association.rt_association_0: Refreshing state... [id=rtbassoc-074c77c7362513561]
aws_route_table_association.rt_association_1: Refreshing state... [id=rtbassoc-0b3321281e370ed43]
aws_route_table_association.rt_association_2: Refreshing state... [id=rtbassoc-0c80d73387b180d51]
aws_eks_cluster.cluster: Refreshing state... [id=eks-spoo-ent9-backend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.cluster has been deleted
  - resource "aws_eks_cluster" "cluster" {
      - id                            = "eks-spoo-ent9-backend" -> null
      - name                          = "eks-spoo-ent9-backend" -> null
        tags                          = {}
        # (14 unchanged attributes hidden)

      - vpc_config {
          - cluster_security_group_id = "sg-03fe24c0b287cde72" -> null
            # (6 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + access_config                = (known after apply)
      + arn                          = (known after apply)
      + certificate_authority        = (known after apply)
      + cluster_id                   = (known after apply)
      + compute_config               = (known after apply)
      + control_plane_scaling_config = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + enabled_cluster_log_types    = (known after apply)
      + endpoint                     = (known after apply)
      + id                           = (known after apply)
      + identity                     = (known after apply)
      + kubernetes_network_config    = (known after apply)
      + name                         = (known after apply)
      + outpost_config               = (known after apply)
      + platform_version             = (known after apply)
      + region                       = (known after apply)
      + remote_network_config        = (known after apply)
      + role_arn                     = (known after apply)
      + status                       = (known after apply)
      + storage_config               = (known after apply)
      + tags                         = (known after apply)
      + upgrade_policy               = (known after apply)
      + version                      = (known after apply)
      + vpc_config                   = (known after apply)
      + zonal_shift_config           = (known after apply)
    }

  # data.aws_eks_cluster_auth.auth will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "auth" {
      + id     = (known after apply)
      + name   = (known after apply)
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # aws_eks_access_entry.app_deploy_actions_access will be created
  + resource "aws_eks_access_entry" "app_deploy_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.infra_actions_access will be created
  + resource "aws_eks_access_entry" "infra_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubActionsTerraformRole"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.app_deploy_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "app_deploy_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.infra_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "infra_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubActionsTerraformRole"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-spoo-ent9-backend"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = "arn:aws:iam::579375260812:role/eks-cluster-role"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = "1.31"

      + access_config {
          + authentication_mode = "API"
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + kubernetes_network_config (known after apply)

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-08837d9ccdb85d124",
            ]
          + subnet_ids                = [
              + "subnet-00f9552ea0b8b879d",
              + "subnet-0994fc654394d1a45",
              + "subnet-0ee538e1285294135",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-spoo-ent9-backend"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "nodeg-spoo-ent9-backend"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::579375260812:role/eks-node-group-role"
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00f9552ea0b8b879d",
          + "subnet-0994fc654394d1a45",
          + "subnet-0ee538e1285294135",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group_rule.cluster_inbound_from_nodes will be created
  + resource "aws_security_group_rule" "cluster_inbound_from_nodes" {
      + description              = "Permite que os worker nodes se conectem ao control plane do EKS"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-08837d9ccdb85d124"
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @CRASPOO, Action: `pull_request`*